*** crates/win-format/src/lib.rs:202:5: replace sanitize_filename -> String with String::new()

*** mutation diff:
--- crates/win-format/src/lib.rs
+++ replace sanitize_filename -> String with String::new()
@@ -194,17 +194,17 @@
 
 /// Check if data starts with .win magic bytes.
 pub fn is_win_file(data: &[u8]) -> bool {
     data.len() >= 4 && &data[0..4] == MAGIC
 }
 
 /// Strip path separators from filename.
 fn sanitize_filename(name: &str) -> String {
-    name.rsplit(['/', '\\']).next().unwrap_or(name).to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn pack_unpack_roundtrip() {

---- tests::empty_file_works stdout ----

thread 'tests::empty_file_works' (9065844) panicked at crates/win-format/src/lib.rs:255:51:
called `Result::unwrap()` on an `Err` value: BadFilename

---- tests::content_change_is_not_container_damage stdout ----

thread 'tests::content_change_is_not_container_damage' (9065842) panicked at crates/win-format/src/lib.rs:433:9:
assertion failed: result.is_ok()

---- tests::binary_content_preserved stdout ----

thread 'tests::binary_content_preserved' (9065841) panicked at crates/win-format/src/lib.rs:275:44:
called `Result::unwrap()` on an `Err` value: BadFilename

failures:
    tests::binary_content_preserved
    tests::content_change_is_not_container_damage
    tests::empty_file_works
    tests::large_file
    tests::missing_proof_section_is_container_damage
    tests::pack_unpack_roundtrip
    tests::path_separators_stripped
    tests::path_traversal_filename_sanitized_not_damaged
    tests::path_traversal_stripped
    tests::unpack_then_repack_identical
    tests::windows_path_traversal_stripped

test result: FAILED. 14 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
