*** crates/win-format/src/lib.rs:202:5: replace sanitize_filename -> String with "xyzzy".into()

*** mutation diff:
--- crates/win-format/src/lib.rs
+++ replace sanitize_filename -> String with "xyzzy".into()
@@ -194,17 +194,17 @@
 
 /// Check if data starts with .win magic bytes.
 pub fn is_win_file(data: &[u8]) -> bool {
     data.len() >= 4 && &data[0..4] == MAGIC
 }
 
 /// Strip path separators from filename.
 fn sanitize_filename(name: &str) -> String {
-    name.rsplit(['/', '\\']).next().unwrap_or(name).to_string()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn pack_unpack_roundtrip() {

---- tests::empty_file_works stdout ----

thread 'tests::empty_file_works' (9066205) panicked at crates/win-format/src/lib.rs:256:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "empty.txt"

---- tests::pack_unpack_roundtrip stdout ----

thread 'tests::pack_unpack_roundtrip' (9066215) panicked at crates/win-format/src/lib.rs:213:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "test.pdf"

---- tests::path_separators_stripped stdout ----

thread 'tests::path_separators_stripped' (9066216) panicked at crates/win-format/src/lib.rs:247:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "file.pdf"

failures:
    tests::empty_file_works
    tests::large_file
    tests::pack_unpack_roundtrip
    tests::path_separators_stripped
    tests::path_traversal_filename_sanitized_not_damaged
    tests::path_traversal_stripped
    tests::windows_path_traversal_stripped

test result: FAILED. 18 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
